==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
MLPModel                                 [64, 10]                  --
├─Flatten: 1-1                           [64, 784]                 --
├─Linear: 1-2                            [64, 128]                 100,480
├─Linear: 1-3                            [64, 64]                  8,256
├─Linear: 1-4                            [64, 10]                  650
==========================================================================================
Total params: 109,386
Trainable params: 109,386
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 7.00
==========================================================================================
Input size (MB): 0.20
Forward/backward pass size (MB): 0.10
Params size (MB): 0.44
Estimated Total Size (MB): 0.74
==========================================================================================